{
  "id": "jazz-blood-bootleg-4gcy",
  "title": "Jazz, Blood & Bootleg",
  "synopsis": "In the glittering underbelly of Prohibition-era Chicago, a prominent nightclub owner is found dead in his office at the height of a star-studded evening. As the jazz plays on upstairs, a web of lies, illegal liquor, and dangerous alliances threatens to unravel in the shadows below.",
  "crimeType": "murder",
  "setting": {
    "location": "The Gilded Trumpet Nightclub",
    "timePeriod": "1924",
    "atmosphere": "smoky, decadent, and treacherous - where jazz mingles with danger and everyone has something to hide"
  },
  "victimParagraph": "Frank 'King' Kingston built The Gilded Trumpet from nothing, transforming it into Chicago's hottest speakeasy through charm, cunning, and questionable connections. A self-made man with expensive tastes and dangerous friends, Kingston was both feared and admired throughout the city. While he maintained a glossy public image, rumors swirled about skimmed profits, prohibited relationships, and ties to organized crime.",
  "sceneImageUrl": "https://v3b.fal.media/files/b/0a8af3b8/ckyzRa-fSQCMlxrrPytZL.jpg",
  "timeline": [
    "7:00 PM - Marcus Johnson arrives early to set up the bar, notices Charles Wellington III already in Kingston's office during routine inventory check",
    "7:30 PM - Dorothy Miller works on books in back office, discovers $50,000 discrepancy in protection payments",
    "8:15 PM - Vivian DuBois arrives late for rehearsal, arguing loudly with Kingston about her married mob boyfriend's influence",
    "9:00 PM - Tommy Romano collects weekly protection money, has heated argument with Kingston about increased rates",
    "9:45 PM - Dorothy Miller shows Kingston the financial records she found, he appears visibly shaken",
    "10:15 PM - Kingston confronts Wellington in private office about 'sick proclivities' and threatens exposure",
    "10:30 PM - Marcus observes Wellington leaving office looking disheveled, making notation in his diary",
    "10:45 PM - Vivian performs her first set while Wellington returns to office area unseen",
    "11:00 PM - Wellington strangles Kingston in office during peak performance noise",
    "11:20 PM - Dorothy Miller finds Kingston's body while delivering updated books",
    "11:25 PM - Tommy Romano secures crime scene, preventing anyone from leaving",
    "11:30 PM - Police arrive, club locked down"
  ],
  "solution": {
    "culprit": "Charles Wellington III",
    "method": "Wellington strangled Kingston with his bare hands during Vivian's performance, when the jazz music was loudest. He chose this moment knowing the sound would mask any struggle, and his position as silent partner gave him unrestricted access to the office.",
    "motive": "Wellington, a diagnosed psychopath, had been using the club's money to fund his darker activities. Kingston discovered evidence of Wellington's true nature and threatened to expose him, triggering a violent rage response.",
    "explanation": "Wellington's presence early in the evening established his access to the office, while the loud music provided perfect cover for the murder. Dorothy's discovery of financial irregularities and Kingston's subsequent confrontation with Wellington provided the trigger. Marcus's diary entry proves Wellington was agitated after being confronted, and the timing of Vivian's performance created the perfect opportunity window for the crime."
  },
  "scoring": {
    "minimumPointsToAccuse": 100,
    "perfectScoreThreshold": 190
  },
  "createdAt": "2026-01-19T01:13:34.375Z"
}