{
  "id": "sacred-blood-royal-flesh-b2e7",
  "title": "Sacred Blood, Royal Flesh",
  "synopsis": "Queen Cersei Lannister is found dead in her chambers, her naked body adorned with mysterious religious symbols painted in what appears to be her own blood. The positioning suggests a ritual, but the violence speaks of personal vengeance. As tensions rise in King's Landing, someone within the Red Keep's walls holds the dark truth of this sacrilegious regicide.",
  "crimeType": "murder",
  "setting": {
    "location": "The Red Keep, King's Landing",
    "timePeriod": "Medieval Fantasy",
    "atmosphere": "Gothic and oppressive, where power, religion, and revenge intertwine"
  },
  "victimParagraph": "Cersei Lannister, Queen Regent of the Seven Kingdoms, was as feared as she was powerful. Her beauty and cunning were legendary, matched only by her capacity for cruelty and her fierce protection of her claim to power. Her enemies were countless, from religious zealots to political rivals, yet few would dare to strike so boldly against the Lioness of Casterly Rock. She was vicious and had many covert enimes",
  "sceneImageUrl": "https://v3b.fal.media/files/b/0a8b040d/A9jT18XSFdLkxs3BzvPae.jpg",
  "timeline": [
    "2:00 PM - John Snow spends several hours in the library researching Targaryen artifacts and Aemon's history, observed by Qyburn during his regular archival work",
    "4:30 PM - Septa Unella spots John Snow walking alone in the gardens, muttering in ancient Valyrian, while she tends to the sept's garden",
    "5:15 PM - Lady Taena witnesses Ser Osmund accepting a pouch of gold from a hooded figure in the courtyard",
    "6:00 PM - Cersei attends evening prayers with Septa Unella, appearing visibly disturbed and speaking of 'ancient powers stirring'",
    "7:00 PM - Qyburn delivers evening potions to chambers, notices blue light under Snow's door",
    "7:30 PM - Ser Osmund leaves his post guarding Cersei's corridor, as agreed in the bribe",
    "8:00 PM - John Snow, possessed by Aemon's spirit, enters Cersei's chambers and commits the murder",
    "8:30 PM - Lady Taena, suspicious of the silence, investigates the corridor and finds Ser Osmund missing from his post",
    "9:00 PM - Cersei's body is discovered by servants",
    "9:15 PM - Qyburn encounters Snow in the hallway, noting his vacant expression and Targaryen dialect mutterings while responding to the murder scene"
  ],
  "solution": {
    "culprit": "John Snow",
    "method": "Exploiting Ser Osmund's absence from his post, Snow entered Cersei's chambers during the evening hours. In a possessed state, he used the heavy bronze lamp as a weapon, striking her repeatedly. The possession gave him unusual strength and prevented Cersei from calling for help effectively.",
    "motive": "While investigating ancient Targaryen artifacts in the North, Snow became possessed by the vengeful spirit of Aemon Targaryen. The spirit, seeking revenge against the Lannisters for their role in destroying the Targaryen dynasty, used Snow as a vessel to exact its revenge.",
    "explanation": "John Snow's unusual behavior and speaking in ancient Valyrian were early signs of possession by Aemon Targaryen's spirit. The timing of the murder coincides with his witnessed presence in the castle, and Qyburn's observation of his disheveled state after the murder provides crucial evidence. The blue light seen under his door earlier suggests the supernatural possession, while his known honor and character make him an unlikely suspect without the influence of possession."
  },
  "scoring": {
    "minimumPointsToAccuse": 100,
    "perfectScoreThreshold": 175
  },
  "createdAt": "2026-01-19T12:50:30.092Z"
}